//PRTKSDS1  JOB (KC03HEF),'PRINT VSAM',CLASS=A,MSGCLASS=H
//STEP1     EXEC PGM=IDCAMS
//SYSPRINT  DD  SYSOUT=*
//VSAMFILE  DD  DSN=KC03HEF.EMPMASTI.KSDS,DISP=SHR
//SYSIN     DD  *
  PRINT INFILE(VSAMFILE) CHAR
/*
